//****************************************************************************
//****************************************************************************
//**                                                                        **
//**            (C)Copyright 1993-2017 Supermicro Computer, Inc.            **
//**                                                                        **
//****************************************************************************
//****************************************************************************
//  File History
//
//  Rev. 1.01
//   Bug Fixed:  Modify "Memory corrected Error Enabling" to "Memory Corrected Error Enabling".
//   Reason:     
//   Auditor:    Hartmann Hsieh
//   Date:       Mar/15/2017
//
//****************************************************************************
//
// This file contains an 'Intel Peripheral Driver' and is      
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may 
// be modified by the user, subject to additional terms of the 
// license agreement                                           
//
// *++
//
// Copyright (c) 1999 - 2015 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
// 
// 
// Module Name:
//
//   SystemEventLogStrings.uni
// 
// Abstract:
// 
//   String definitions for the system event log screen
// 
// Revision History:
// 
// --*/

/=#

#langdef   en-US "English"
#langdef uqi "UQI"
//
// Event Log
//
// APTIOV_SERVER_OVERRIDE_RC_START
#string STR_EVENT_LOG_FORM_TITLE             #language en-US "Runtime Error Logging"        // #language en-US "System Event Log"
#string STR_EVENT_LOG_FORM_HELP              #language en-US  "Press <Enter> to view or change the runtime error log configuration." //#language en-US "Press <Enter> to view or change the event log configuration."
// APTIOV_SERVER_OVERRIDE_RC_END

#string STR_SYSTEM_ERRORS_PROMPT             #language en-US "System Errors"
// APTIOV_SERVER_OVERRIDE_RC_START : Remove space
#string STR_SYSTEM_ERRORS_HELP               #language en-US "System Error Enable/Disable setup options."
// APTIOV_SERVER_OVERRIDE_RC_END : Remove space

#string STR_POISON_EN_PROMPT                 #language en-US "System Memory Poison "
#string STR_POISON_EN_HELP                   #language en-US "Enable/Disable System Memory Poison"

#string STR_VIRAL_EN_PROMPT                  #language en-US "Viral Status"
#string STR_VIRAL_EN_HELP                    #language en-US "Enable/Disable Viral"

#string STR_VIRAL_CLEAR_STATUS_PROMPT        #language en-US "Clear Viral Status"
#string STR_VIRAL_CLEAR_STATUS_HELP          #language en-US "Enable/Disable Clear Viral Status"

#string STR_CLOAKING_EN_PROMPT               #language en-US "System Cloaking"
#string STR_CLOAKING_EN_HELP                 #language en-US "When enabled, Corrected and UCNA errors are masked from OS/SW visibility"

#string STR_UBOX_PCU_MCA_EN_PROMPT           #language en-US "UboxToPcuMca Enabling"
#string STR_UBOX_PCU_MCA_EN_HELP             #language en-US "Enbales or disables Ubox Local errors to cause MCA."

#string STR_CATERR_GPIO_SMI_EN_PROMPT        #language en-US "CATERR->GPIO->SMI"
#string STR_CATERR_GPIO_SMI_EN_HELP          #language en-US "Enable/Disable PCH GPIO to trigger SMI on CATERR"

#string STR_UBOX_UMC_SMI_EN_PROMPT           #language en-US "UBOX UMC TO SMI ENABLE"
#string STR_UBOX_UMC_SMI_EN_HELP             #language en-US "Enable/Disable UBOX UMC SMI SIGNALLING"

#string STR_SPINLOOP_PROMPT                  #language en-US "FatalErrDebugHalt"
#string STR_SPINLOOP_HELP                    #language en-US "DEBUG loop for McBank Fatal error case ONLY. Warning: Enable this knob only in conjuction with ITP as thread will halt in Fatal error flow"

#string STR_EMCA_FORM_TITLE                  #language en-US "eMCA Settings"
#string STR_EMCA_FORM_HELP                   #language en-US "Press <Enter> to view or change the eMCA configuration."

#string STR_WHEA_FORM_TITLE                  #language en-US "Whea Settings"
#string STR_WHEA_FORM_HELP                   #language en-US "Press <Enter> to view or change the WHEA configuration."

#string STR_KTI_ERR_FORM_TITLE               #language en-US "UPI Error Enabling"
#string STR_KTI_ERR_FORM_HELP                #language en-US "Press <Enter> to view or change the UPI errors enabling options."

#string STR_ERR_INJ_FORM_TITLE               #language en-US "Error Injection Settings"
#string STR_ERR_INJ_FORM_HELP                #language en-US "Press <Enter> to view or change the Error Injection configuration."

#string STR_MEM_ERR_FORM_TITLE               #language en-US "Memory Error Enabling"
#string STR_MEM_ERR_FORM_HELP                #language en-US "Press <Enter> to view or change the Memory errors enabling options."

#string STR_PCI_ERR_FORM_TITLE               #language en-US "PCIe Error Enabling"
#string STR_PCI_ERR_FORM_HELP                #language en-US "Press <Enter> to view or change the PCIe errors enabling options."

#string STR_IIO_ERR_FORM_TITLE               #language en-US "IIO Error Enabling"
#string STR_IIO_ERR_FORM_HELP                #language en-US "Press <Enter> to view or change the IIO errors enabling options."

#string STR_PLATFORM_ERR_FORM_TITLE          #language en-US "Platform Level Error Enabling"
#string STR_PLATFORM_ERR_FORM_HELP           #language en-US "Press <Enter> to view or change the Platform Level errors enabling options."


#string STR_EMCALOG_SUPPORT_EN_PROMPT        #language en-US "EMCA Logging Support"
#string STR_EMCALOG_SUPPORT_EN_HELP          #language en-US "Enable/Disable EMCA Logging"

#string STR_EMCAIGN_OPTIN_PROMPT             #language en-US "Ignore OS EMCA Opt-in"
#string STR_EMCAIGN_OPTIN_HELP               #language en-US "Enable/Disable Ignore OS EMCA Opt-in and log"

#string STR_EMCA_CSMI_EN_PROMPT              #language en-US "EMCA CMCI-SMI Morphing"
#string STR_EMCA_CSMI_EN_HELP                #language en-US "Enable/Disable EMCA CSMI"

#string STR_EMCA_MSMI_EN_PROMPT              #language en-US "EMCA MCE-SMI Enable"
#string STR_EMCA_MSMI_EN_HELP                #language en-US "Enable/Disable EMCA Uncorrected SMI for gen1 and gen2"
#string STR_EMCAGEN1                         #language en-US "EMCA gen 1 Dual Mode"
#string STR_EMCAGEN2                         #language en-US "EMCA gen 2 - MSMI"

#string STR_EMCACSMIGEN1                     #language en-US "EMCA gen 1 Lite"
#string STR_EMCACSMIGEN2                     #language en-US "EMCA gen 2 CSMI"

#string STR_CORR_ERR_ELOG_EN_PROMPT          #language en-US "Corrected Error eLog"
#string STR_CORR_ERR_ELOG_EN_HELP            #language en-US "Enable/Disable Corrected Error eLog"

#string STR_MEM_ERR_ELOG_EN_PROMPT           #language en-US "Memory Error eLog"
#string STR_MEM_ERR_ELOG_EN_HELP             #language en-US "Enable/Disable Memory Error eLog"

#string STR_PROC_ERR_ELOG_EN_PROMPT          #language en-US "Processor Error eLog"
#string STR_PROC_ERR_ELOG_EN_HELP            #language en-US "Enable/Disable Processor Error eLog"

#string STR_LMCE_SUPPORT_EN_PROMPT           #language en-US "LMCE Support"
#string STR_LMCE_SUPPORT_EN_HELP             #language en-US "Enable/Disable Local MCE firmware support"

#string STR_WHEA_SUPPORT_EN_PROMPT           #language en-US "WHEA Support"
#string STR_WHEA_SUPPORT_EN_HELP             #language en-US "Enable/Disable WHEA support" 

#string STR_WHEA_ERROR_INJ_SUPPORT_PROMPT    #language en-US "WHEA Error Injection Support"
#string STR_WHEA_ERROR_INJ_SUPPORT_HELP      #language en-US "Enable/Disable WHEA Error Injection Support. Please disable DIRECTORY MODE for Memory Error Injection"

#string STR_WHEA_ACPI5_SUPPORT_PROMPT        #language en-US "WHEA Error Injection 5.0 Extension"
#string STR_WHEA_ACPI5_SUPPORT_HELP          #language en-US "Whea EINJ ACPI 5.0 support for set error type with address and vendor extensions."

#string STR_WHEA_LOG_MEM_ERR_EN_PROMPT       #language en-US "Whea Log Memory Error"
#string STR_WHEA_LOG_MEM_ERR_EN_HELP         #language en-US "Enable/Disable Whea Log Memory Error"

#string STR_WHEA_LOG_PROC_ERR_EN_PROMPT       #language en-US "Whea Log Processor Error"
#string STR_WHEA_LOG_PROC_ERR_EN_HELP         #language en-US "Enable/Disable Whea Log Processor Error"

#string STR_WHEA_LOG_PCI_ERR_EN_PROMPT       #language en-US "Whea Log PCI Error"
#string STR_WHEA_LOG_PCI_ERR_EN_HELP         #language en-US "Enable/Disable Whea Log PCI Error"

#string STR_MCA_BANK_INJ_EN_PROMPT           #language en-US "Mca Bank Error Injection Support "
#string STR_MCA_BANK_INJ_EN_HELP             #language en-US "Enable/Disable Mca Bank Error Injection Support."

#string STR_MCA_BANK_WARM_BOOT_CLEAR_ERRORS_PROMPT           #language en-US "Mca Bank Warm Boot Clear Errors"
#string STR_MCA_BANK_WARM_BOOT_CLEAR_ERRORS_HELP             #language en-US "Enable/Disable Mca Bank Warm Boot Clear Errors."

#string STR_WHEA_PCIE_ERR_INJ_EN_PROMPT      #language en-US "Whea PCIE Error Injection Support "
#string STR_WHEA_PCIE_ERR_INJ_EN_HELP        #language en-US "Enable/Disable Whea PCIE Error Injection Support."

#string STR_WHEA_PCIE_EINJAT_PROMPT          #language en-US "Whea PCIe Error Injection Action Table"
#string STR_WHEA_PCIE_EINJAT_HELP            #language en-US "Use Action Table for Whea PCIe Error Injection"

#string STR_ME_SEG_ERR_INJ_EN_PROMPT          #language en-US "ME Seg Error Injection Support"਍ഀ
#string STR_ME_SEG_ERR_INJ_EN_HELP            #language en-US "Enable/Disable ME Seg Error Injection Support."਍ഀ

#string STR_PARITY_CHECK_ENABLE_PROMPT        #language en-US "Enable HA Parity Check"਍ഀ
#string STR_PARITY_CHECK_ENABLE_HELP          #language en-US "Enable/Disable HA Parity Check."਍ഀ

#string STR_KTIFOSMI_PROMPT                  #language en-US "SMI UPI Lane Failover "
#string STR_KTIFOSMI_HELP                    #language en-US "Enable/disables SMI when clock/data failover is set"

#string STR_MEM_ERR_EN_PROMPT                #language en-US "Memory Error"
#string STR_MEM_ERR_EN_HELP                  #language en-US "Enable/Disable Memory Error"

#string STR_PCIE_COR_ERR_CNTR_PROMPT         #language en-US "PCIE Corrected Error Threshold Counter"
#string STR_PCIE_COR_ERR_CNTR_HELP           #language en-US "Enable/Disable PCIE Corrected Error Counter"

#string STR_PCIE_COR_ERR_THRES_PROMPT        #language en-US "PCIE Corrected Error Threshold"
#string STR_PCIE_COR_ERR_THRES_HELP          #language en-US "0x001 - 0xffff"

#string STR_PCIE_COR_ERR_BITMASK_PROMPT      #language en-US "PCIE Corrected Error Threshold Mask"
#string STR_PCIE_COR_ERR_BITMASK_HELP        #language en-US "BitMap for errors to be included in error count. BIT0 Receiver Error Mask, BIT1 BAD TLP Mask, BIT2 BAD DLLP Mask, BIT3 Replay Num Rollover Mask, BIT4 Replay Timer Timeout Mask, BIT5 Advisory Non Fatal Mask"

//SMCPKG_SUPPORT        #string STR_MEM_COR_ERR_EN_PROMPT            #language en-US "Memory Corrected Error"
#string STR_MEM_COR_ERR_EN_PROMPT            #language en-US "Memory Corrected Error Enabling"  //SMCPKG_SUPPORT
#string STR_MEM_COR_ERR_EN_HELP              #language en-US "Enable/Disable Memory Corrected Error" 

#string STR_MEM_COR_ERR_THRES_PROMPT         #language en-US "Memory Corrected Error Threshold"
#string STR_MEM_COR_ERR_THRES_HELP           #language en-US "0x001 - 0xfff" 

#string STR_MEM_RANK_COR_ERR_THRES_PROMPT    #language en-US "Memory Rank Corrected Error Threshold"
#string STR_MEM_RANK_COR_ERR_THRES_HELP	     #language en-US "0x001 - 0xfff" 

#string STR_MEM_LEAKY_BUCKET_VALUE_PROMPT    #language en-US "Memory Leaky Bucket Value"
#string STR_MEM_LEAKY_BUCKET_VALUE_HELP	     #language en-US "0x0000 - 0xffff" 

// APTIOV_SERVER_OVERRIDE_RC_START : Unlocking the MSR 0x790 for the ErrorInjection to work from RAS tools
#string STR_UNLOCK_MSR_PROMPT        	#language en-US "S/W Error Injection Support "
#string STR_UNLOCK_MSR_HELP         	#language en-US "When Enabled S/W Error Injection is supported by unlocking MSR 0x790"
// APTIOV_SERVER_OVERRIDE_RC_END : Unlocking the MSR 0x790 for the ErrorInjection to work from RAS tools
#string STR_MEM_MIRROR_FAIL_OVER_EN_PROMPT   #language en-US "Mirror Fail Over"
#string STR_MEM_MIRROR_FAIL_OVER_EN_HELP     #language en-US "Enable/Disable Mirror Fail Over"

#string STR_DIR_SCRUB                        #language en-US "Direct Scrub"
#string STR_BADCHNL_FIRST                    #language en-US "Bad Channel First"
#string STR_HIGHER_REL                       #language en-US "Higher Reliability Bios enabled"

#string STR_FNV_ERRORS_PROMPT                #language en-US "NVMCTLR Errors"
#string STR_FNV_ERRORS_HELP                  #language en-US "Enable/Disabled NVMCTLR Error Reporting & Logging"

#string STR_FNV_LOW_PRIORITY_SIGNAL_PROMPT   #language en-US "NVMCTLR Low Priority Error Signaling"
#string STR_FNV_LOW_PRIORITY_SIGNAL_HELP     #language en-US "Selection of signaling for errors bucketed as Low Priority"

#string STR_FNV_HIGH_PRIORITY_SIGNAL_PROMPT  #language en-US "NVMCTLR High Priority Error Signaling"

#string STR_SMI_SIGNAL                       #language en-US "SMI"
#string STR_ERR0_PIN                         #language en-US "ERR0# Pin"
#string STR_ERRPIN                           #language en-US "Error Pin"
#string STR_CMCI                             #language en-US "CMCI"
#string STR_NONE                             #language en-US "None"

#string NGN_ADDRESS_RANGE_SCRUB_PROMPT     #language en-US "Set NGN Address Range Scrub"
#string NGN_ADDRESS_RANGE_SCRUB_HELP       #language en-US "Enable/Disable NGN DIMM Physical Address Range scrub"

#string NGN_HOST_ALERT_AIT_PROMPT              #language en-US "Set NGN Host Alert Policy for AIT Error"
#string NGN_HOST_ALERT_AIT_HELP                #language en-US "Configures to signal Poison or Viral upon receiving Address Indirection Table Error"

#string NGN_HOST_ALERT_DPA_PROMPT              #language en-US "Set NGN Host Alert Policy for DPA Error"
#string NGN_HOST_ALERT_DPA_HELP                #language en-US "Configures to signal Poison or Viral upon receiving DIMM Physical Address Error"

#string STR_POISON                             #language en-US "Poison"
#string STR_VIRAL                              #language en-US "Viral"

#string STR_SPARE_INT_PROMPT                 #language en-US "Spare Interrupt"
#string STR_SPARE_INT_HELP                   #language en-US "Spare Interrupt Selection"

#string STR_IIO_ERR_SUPPORT_EN_PROMPT        #language en-US "IIO/PCH Global Error Support"
#string STR_IIO_ERR_SUPPORT_EN_HELP          #language en-US "Enable/Disable IIO/PCH Error Support." 

#string STR_IIO_MCA_SUPPORT_EN_PROMPT        #language en-US "IIO MCA Support"
#string STR_IIO_MCA_SUPPORT_EN_HELP          #language en-US "Enable/Disable IIO MCA Support" 

#string STR_IIO_ERROR_REG_CLEAR_EN_PROMPT    #language en-US "IIO Error Registers Clear"
#string STR_IIO_ERROR_REG_CLEAR_EN_HELP      #language en-US "Enable/Disable Clear IIO Error Registers" 

#string STR_IIO_ERR_PIN_PROG_EN_PROMPT       #language en-US "IIO Error Pin Programming"
#string STR_IIO_ERR_PIN_PROG_EN_HELP         #language en-US "Enable/Disable IIO Error Pin Programming" 

#string STR_IIO_LER_SUPPORT_EN_PROMPT        #language en-US "IIO LER Support"
#string STR_IIO_LER_SUPPORT_EN_HELP          #language en-US "Enable/Disable IIO LER Support" 

#string STR_IIO_MA_ERRLOG_LER_PROMPT         #language en-US "LER MA Error Logging"
#string STR_IIO_MA_ERRLOG_LER_HELP           #language en-US "Disables logging MA error when PCIE port in LER"

#string STR_IIO_COH_INTERFACE_ERR_EN_PROMPT  #language en-US "IIO Coherent Interface Error"
#string STR_IIO_COH_INTERFACE_ERR_EN_HELP    #language en-US "Enable/Disable IIO Coherent Interface Error" 

#string STR_LOG_IRP0_PARITY_ERROR_PROMPT     #language en-US "IIO IRP0 protocol parity error"
#string STR_LOG_IRP_PARITY_ERROR_HELP        #language en-US "Enable or disable Coherent Interface protocol IIO  parity error reporting"

#string STR_LOG_IRP0_QTOVERFLOW_ERROR_PROMPT #language en-US "IIO IRP0 protocol qt overflow underflow error"
#string STR_LOG_IRP_QTOVERFLOW_ERROR_HELP    #language en-US "Enable or disable IIO Coherent Interface protocol queue table overflow or underflow error reporting"

#string STR_LOG_IRP0_UNEXPRSP_ERROR_PROMPT   #language en-US "IIO IRP0 protocol rcvd unexprsp"
#string STR_LOG_IRP_UNEXPRSP_ERROR_HELP      #language en-US "Enable or disable IIO Coherent Interface protocol layer received unexpected response or completion error reporting"

#string STR_LOG_IRP0_UNALIGNEDACC_ERROR_PROMPT #language en-US "IIO IRP0 csr acc 32b unaligned"
#string STR_LOG_IRP_UNALIGNEDACC_ERROR_HELP  #language en-US "Enable or disable IIO Coherent Interface CSR Access Crossing 32-bit Boundary error reporting"

#string STR_LOG_IRP0_UNCECCCS0_ERROR_PROMPT  #language en-US "IIO IRP0 wrcache uncecccs0 error"
#string STR_LOG_IRP0_UNCECCCS1_ERROR_PROMPT  #language en-US "IIO IRP0 wrcache uncecccs1 error"
#string STR_LOG_IRP_UNCECC_ERROR_HELP        #language en-US "Enable or disable IIO Coherent Interface Write Cache Un-correctable ECC error reporting"

#string STR_LOG_IRP0_RCVDPOISON_ERROR_PROMPT #language en-US "IIO IRP0 protocol rcvd poison error"
#string STR_LOG_IRP_RCVDPOISON_ERROR_HELP    #language en-US "Enable or disable IIO Coherent Interface Protocol Layer Received Poisoned Packet error reporting"

#string STR_LOG_IRP0_CRRECCCS0_ERROR_PROMPT  #language en-US "IIO IRP0 wrcache correcccs0 error"
#string STR_LOG_IRP0_CRRECCCS1_ERROR_PROMPT  #language en-US "IIO IRP0 wrcache correcccs1 error"

#string STR_LOG_IRP_CRRECC_ERROR_HELP        #language en-US "Enable or disable IIO Coherent Interface Write Cache Correctable ECC error reporting"

#string STR_IIO_MISC_ERR_EN_PROMPT           #language en-US "IIO Misc. Error"
#string STR_IIO_MISC_ERR_EN_HELP             #language en-US "Enable/Disable IIO Misc. Error" 

#string STR_IIO_VTD_ERR_EN_PROMPT            #language en-US "IIO Vtd Error"
#string STR_IIO_VTD_ERR_EN_HELP              #language en-US "Enable/Disable IIO Vtd Error" 

#string STR_IIO_DMA_ERR_EN_PROMPT            #language en-US "IIO Dma Error"
#string STR_IIO_DMA_ERR_EN_HELP              #language en-US "Enable/Disable IIO Dma Error" 

#string STR_IIO_DMI_ERR_EN_PROMPT            #language en-US "IIO Dmi Error"
#string STR_IIO_DMI_ERR_EN_HELP              #language en-US "Enable/Disable IIO Dmi Error"

#string STR_PCIE_ERR_EN_PROMPT    	         #language en-US "PCIE Error"
#string STR_PCIE_ERR_EN_HELP                 #language en-US "Enable/Disable PCIE Error" 

#string STR_IIO_PCIE_ADD_COR_ERR_EN_PROMPT   #language en-US "IIO PCIE Additional Corrected Error"
#string STR_IIO_PCIE_ADD_COR_ERR_EN_HELP  	 #language en-US "Enable/Disable IIO PCIE Additional Corrected Error" 

#string STR_IIO_PCIE_ADD_UR_ERR_EN_PROMPT    #language en-US "IIO PCIE Additional Uncorrected Error"
#string STR_IIO_PCIE_ADD_UR_ERR_EN_HELP      #language en-US "Enable/Disable IIO PCIE Additional Uncorrected Error" 

#string STR_IIO_PCIE_AER_SPEC_COM_EN_PROMPT  #language en-US "IIO PCIE AER Spec Compliant"
#string STR_IIO_PCIE_AER_SPEC_COM_EN_HELP    #language en-US "Enable/Disable IIO PCIE AER Spec Compliant"


#string STR_PCIEX_COR_ERR_PROMPT             #language en-US "Corrected Error"
#string STR_PCIEX_COR_ERR_HELP               #language en-US "Enable & escalate Correctable Errors to error pins."

#string STR_PCIEX_UR_ERR_PROMPT              #language en-US "Uncorrected Error"
#string STR_PCIEX_UR_ERR_HELP                #language en-US "Enable & escalate Uncorrectable/Recoverable to error pins."

#string STR_PCIEX_FATAL_ERR_PROMPT           #language en-US "Fatal Error Enable"
#string STR_PCIEX_FATAL_ERR_HELP             #language en-US "Enable & escalate fatal errors to error pins."

#string STR_PCIE_AER_COR_ERR_EN_PROMPT       #language en-US "PCIE AER Corrected Errors"
#string STR_PCIE_AER_COR_ERR_EN_HELP  	     #language en-US "Enable/Disable PCIE AER Corrected Errors" 

#string STR_PCIE_AER_ANF_ERR_EN_PROMPT       #language en-US "PCIE AER Advisory Nonfatal Error"
#string STR_PCIE_AER_ANF_ERR_EN_HELP  	     #language en-US "Enable/Disable PCIE AER Advisory Nonfatal Error"

#string STR_PCIE_AER_NFATL_ERR_EN_PROMPT     #language en-US "PCIE AER NonFatal Error"
#string STR_PCIE_AER_NFATL_ERR_EN_HELP       #language en-US "Enable/Disable PCIE AER NonFatal Error"

#string STR_PCIE_AER_FATL_ERR_EN_PROMPT      #language en-US "PCIE AER Fatal Error "
#string STR_PCIE_AER_FATL_ERR_EN_HELP  	     #language en-US "Enable/Disable PCIE AER Fatal Error"

#string STR_SERR_PROP_EN_PROMPT              #language en-US "SERR Propagation"
#string STR_SERR_PROP_EN_HELP                #language en-US "Enable/Disable SERR propagation"

#string STR_PERR_PROP_EN_PROMPT              #language en-US "PERR Propagation"
#string STR_PERR_PROP_EN_HELP                #language en-US "Enable/Disable PERR propagation"

#string STR_OS_SIGON_SERR_EN_PROMPT          #language en-US "Signal to OS on SERR"
#string STR_OS_SIGON_SERR_EN_HELP            #language en-US "Enable/Disable Signal to OS on SERR"

#string STR_OS_SIGON_PERR_EN_PROMPT          #language en-US "Signal to OS on PERR"
#string STR_OS_SIGON_PERR_EN_HELP            #language en-US "Enable/Disable Signal to OS on PERR"
   
#string STR_BMC_MONITORING_CATERR_PROMPT     #language en-US "BMC Monitoring for CATERR#"
#string STR_BMC_MONITORING_CATERR_HELP       #language en-US "Enable/Disable BMC Monitoring for CATERR#"
//SGI+
#string STR_MAK_PCIEX_CORR_PROMPT       #language en-US " Mask PCI-Ex Corr.Error"                                        
#string STR_MAK_PCIEX_CORR_HELP         #language en-US "Mask runtime event for  PCIe correctable errors of IIO port."
//SGI-
//
// End of file
//
